//-----------------------------------------------------------------------------------------------------------
// 2025 2학기 C++ 월56수78					9. 3 수요일                                             (1주 2일)
//-----------------------------------------------------------------------------------------------------------
// C++ I/O
// ----------------------------------------------------------------------------------------------------------

#include <iostream>
#include <string>
#include <print>
#include <thread>
#include <chrono>
#include "save.h"

// [문제] 이름을 입력받아 환영한다고 출력하자.
// [문제] 구구단을 출력하자.
// 몇 단을 원하는 지 물어 봐서 다음과 같은 형식으로 화면 출력하라.
// 7 x 1 = 7
// 7 x 2 = 14
// 7 x 9 = 63

//--------
int main()
//--------
{
	// C++ 프로그램은 프로그램이 시작하면 입출력을 하기 위한 객체
	// cout(모니터), cin(키보드), cerr(모니터), clog(모니터)를 자동생성한다.
	std::cout << "이름을 알려주세요 : ";
	std::string name;
	std::cin >> name;

	// 환영 메시지를 영원히 출력하라.
	using namespace std::chrono_literals;
	for (char i = 0; ; ++i) {
		std::println("{:^80}님 환영합니다! - {}", name, i );
		std::this_thread::sleep_for(100ms);
	}

	save("main.cpp");
	
	}