//-----------------------------------------------------------------------------------------------------------
// 2025 2학기 C++ 월56수78					10. 15 월요일                                             (6주 2일)
// 10/27 - 8주 1일 중간시험
//-----------------------------------------------------------------------------------------------------------
// FILE I/O
//----------------------------------------------------------------------------------------------------------
#include <iostream>
#include <fstream>
#include <print>
#include "save.h"
using namespace std;

// [문제] "몇개인지모르는int"에 정확하게 1000만개의 int가 저장되어 있다.
// 오름차순으로 정렬하고 20칸마다 한 개씩 모두 출력하라.

//--------
int main()
//--------
{
	std::ifstream in{ "몇개인지모르는int" };

	if (not in) {
		return 20251510;
	}

	int num;
	int nums[1000'0000]{ };
	unsigned cnt{};
	cout << "1" << endl;
	while (in >> num) {
		nums[cnt] = num;
		++cnt;
	}
	cout << "nums 완료" << endl;

	
	cout << "정렬 완료" << endl;

	for (int i = 0; i < 1000'0000; ++i) {
		print("{:20}", nums[i]);
	}

	//save("main.cpp");
}