//-----------------------------------------------------------------------------------------------------------
// 2025 2학기 C++ 월56수78					9. 8 수요일                                             (2주 1일)
//-----------------------------------------------------------------------------------------------------------
// 자료형과 변수
// ----------------------------------------------------------------------------------------------------------

#include <iostream>
#include<bitset>
#include<limits>
#include "save.h"

// [실습] int 값 2개를 입력받아 이것을 더한 결과를 내주는 함수
// add를 작성하여 결과를 출력하라.

//--------
int main()
//--------
{
	int n = std::numeric_limit<int>::max();

	std::cout << n << '\n';

	//save("main.cpp");
	//constexpr int n = std::numeric_limit<int>::max();
}