//-----------------------------------------------------------------------------------------------------------
// 2025 2학기 C++ 월56수78					11. 12 수요일                                             (10주 2일)
// 12/15 - (15주 1일) 기말시험 - 다형성(코드는 수업에 사용한 그대로)
//-----------------------------------------------------------------------------------------------------------
// STRING - std::string을 이해하려고 만든 클래스
// operator overloading - 연산자 오버로딩
//----------------------------------------------------------------------------------------------------------
#include <iostream>
#include <string>
#include "save.h"
#include "STRING.h"
using namespace std;

extern bool 관찰;			// 관찰하고 싶으면 true로 바꾸자

//--------
int main()
//--------
{
	관찰 = true;

	//STRING s = "2025년" + STRING("11월 17일");
	string s = "2025년" + string("11월 17일");

	//s.show();
	cout << s << endl;
	//cout.operator<<((char*)s.data()) << endl;

	//save("main.cpp");
}
